Revit 2027 API
RebarConstraint.SetDistanceToTargetHostEdgeCover Method
 Sets the distance from the RebarConstrainedHandle to the target host edge cover. The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistanceToTargetHostEdgeCover(
	double distanceToTargetEdgeCover
)
Public Sub SetDistanceToTargetHostEdgeCover (
	distanceToTargetEdgeCover As Double
)
public:
void SetDistanceToTargetHostEdgeCover(
	double distanceToTargetEdgeCover
)
member SetDistanceToTargetHostEdgeCover :
        distanceToTargetEdgeCover : float -> unit
Parameters
distanceToTargetEdgeCover Double
 The distance to target host edge cover.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for distanceToTargetEdgeCover must be no more than 30000 feet in absolute value.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToHostEdgeCover'. -or- The RebarConstrainedHandle doesn't allow distance for constraint of ToHostEdge or ToHostEdgeCover type.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace